In [1]:
import pandas as pd

In [3]:
# Created empty Series and store in ser veriable

ser = pd.Series()

In [4]:
ser

Series([], dtype: object)

In [9]:
ser=pd.Series([0,10,20,30,40,50,60,70,80,90,100])

In [10]:
ser # datatype is int64

0       0
1      10
2      20
3      30
4      40
5      50
6      60
7      70
8      80
9      90
10    100
dtype: int64

In [13]:
ser1 = pd.Series([1,2,3,4.5,6]) # added one float value and datatype is now float64

In [12]:
ser1

0    1.0
1    2.0
2    3.0
3    4.5
4    6.0
dtype: float64

In [15]:
ser2 = pd.Series([1,2,3,4,'5']) # added one str value and now datatype is object
ser2

0    1
1    2
2    3
3    4
4    5
dtype: object

In [21]:
# Lets create Dictionary

dict = {'A': [1,2,3],
       'B': [4,5,6],
       'C':[7,8,9]}

In [24]:
dict

{'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]}

In [26]:
df = pd.DataFrame(dict)

In [27]:
#Add new Column and add values into in.
df["State"] = "BR:SR:GR".split(":")
df

   A  B  C State
0  1  4  7    BR
1  2  5  8    SR
2  3  6  9    GR

In [28]:
#How to create Nan Values and its manipulation
import numpy as np
dict = {'A' : [1,2,np.nan],
       'B' : [1,np.nan,3],
       'C' : [np.nan,2,3]}

In [29]:
dict

{'A': [1, 2, nan], 'B': [1, nan, 3], 'C': [nan, 2, 3]}

In [32]:
df1 = pd.DataFrame(dict)
df1

     A    B    C
0  1.0  1.0  NaN
1  2.0  NaN  2.0
2  NaN  3.0  3.0

In [33]:
df1["d"] = [1,2,3]

In [34]:
df1

     A    B    C  d
0  1.0  1.0  NaN  1
1  2.0  NaN  2.0  2
2  NaN  3.0  3.0  3

In [41]:
#How to Drop Nan Value from Pandas 
print("Lets delete Nan value in columns wise \n---------------------")
df1.dropna(axis=1) # drop nan value in columns

Lets delete Nan value in columns wise
---------------------

   d
0  1
1  2
2  3

In [36]:
df1

     A    B    C  d
0  1.0  1.0  NaN  1
1  2.0  NaN  2.0  2
2  NaN  3.0  3.0  3

In [42]:
print("Lets delete Nan value in rows wise \n---------------------")
df1.dropna(axis = 0) # drop nan value in rows

Lets delete Nan value in rows wise
---------------------

Empty DataFrame
Columns: [A, B, C, d]
Index: []

In [40]:
df1

     A    B    C  d
0  1.0  1.0  NaN  1
1  2.0  NaN  2.0  2
2  NaN  3.0  3.0  3

In [44]:
# lets fill the nan value now

df1.fillna(value = 1) # we have  given default values to fill

     A    B    C  d
0  1.0  1.0  1.0  1
1  2.0  1.0  2.0  2
2  1.0  3.0  3.0  3

In [46]:
df1

     A    B    C  d
0  1.0  1.0  NaN  1
1  2.0  NaN  2.0  2
2  NaN  3.0  3.0  3

In [47]:
#lets fill the nan value with an average of a columns

df1.fillna(value = df1['A'].mean())

     A    B    C  d
0  1.0  1.0  1.5  1
1  2.0  1.5  2.0  2
2  1.5  3.0  3.0  3

In [49]:
df1 # you can check the changes we made is not saved. Lets save it permanently

     A    B    C  d
0  1.0  1.0  NaN  1
1  2.0  NaN  2.0  2
2  NaN  3.0  3.0  3

In [51]:
df1.fillna(value = df1['A'].mean(), inplace = True) # using inplace, it makes the data save for future referes

In [53]:
df1 # now can check it is saved

     A    B    C  d
0  1.0  1.0  1.5  1
1  2.0  1.5  2.0  2
2  1.5  3.0  3.0  3

In [55]:
#let create new DataFrame 

data={'Company':['Goog','Goog','MSFT','MSFT','FB','FB'],
      'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
     'Sales':[200,120,340,124,243,350]}

In [56]:
data

{'Company': ['Goog', 'Goog', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [59]:
df2 = pd.DataFrame(data)
df2

  Company   Person  Sales
0    Goog      Sam    200
1    Goog  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [69]:
dfcom = df2.groupby("Company")['Sales']

In [73]:
print(np.sort(dfcom.mean()))

[160.  232.  296.5]

In [77]:
dfcom.sum()

Company
FB      593
Goog    320
MSFT    464
Name: Sales, dtype: int64

In [78]:
#Concating DataFrame 
#There are Three types of concating  -1 = Concat
#                                     2  = Merge
#                                     3 =  Join

In [79]:
df

   A  B  C State
0  1  4  7    BR
1  2  5  8    SR
2  3  6  9    GR

In [80]:
df1

     A    B    C  d
0  1.0  1.0  1.5  1
1  2.0  1.5  2.0  2
2  1.5  3.0  3.0  3

In [85]:
result_1 = pd.DataFrame({'Mat':[45,68,35,65],
                     'Eng':[54,87,36,52],
                     'Sci':[66,77,88,70],
                     'Chem':[54,79,58,76]},
                    index=['Ravi','Shyam','Saurav','Abhi'])

In [86]:
result_1

        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76

In [97]:
result_2 = pd.DataFrame({"Mat" :[50,87,69,71],
             'Eng':[66,50,87,69],
             'Sci':[34,66,69,71],
             'Chem':[54,87,34,66]},
            index = ['Siya','Riya','Piya','Tiya'])
result_2

      Mat  Eng  Sci  Chem
Siya   50   66   34    54
Riya   87   50   66    87
Piya   69   87   69    34
Tiya   71   69   71    66

In [98]:
result_1

        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76

In [99]:
result_3 = pd.DataFrame({'Mat':[66,50,87,56],
                     'Eng':[56,87,89,71],
                     'Sci':[77,88,70,52],
                     'Chem':[34,56,56,87]},
                       index = ['Astha','Rohit','Rahul','Shital'])

In [100]:
result_3

        Mat  Eng  Sci  Chem
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [124]:
# lets Concate them

print("Marks of all the student are mentioned below(Rows wise) \n",'-'*30)
concat_1 = pd.concat([result_1,result_2,result_3],axis = 0)
concat_1

Marks of all the student are mentioned below(Rows wise)
 ------------------------------

        Mat  Eng  Sci  Chem
Ravi     45   54   66    54
Shyam    68   87   77    79
Saurav   35   36   88    58
Abhi     65   52   70    76
Siya     50   66   34    54
Riya     87   50   66    87
Piya     69   87   69    34
Tiya     71   69   71    66
Astha    66   56   77    34
Rohit    50   87   88    56
Rahul    87   89   70    56
Shital   56   71   52    87

In [125]:
print("Marks of all the student are mentioned below(columns wise) \n",'-'*30)
concat_2 = pd.concat([result_1,result_2,result_3],axis = 1)
concat_2

Marks of all the student are mentioned below(columns wise)
 ------------------------------

         Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem
Ravi    45.0  54.0  66.0  54.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Shyam   68.0  87.0  77.0  79.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Saurav  35.0  36.0  88.0  58.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Abhi    65.0  52.0  70.0  76.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Siya     NaN   NaN   NaN   NaN  50.0  66.0  34.0  54.0   NaN   NaN   NaN   NaN
Riya     NaN   NaN   NaN   NaN  87.0  50.0  66.0  87.0   NaN   NaN   NaN   NaN
Piya     NaN   NaN   NaN   NaN  69.0  87.0  69.0  34.0   NaN   NaN   NaN   NaN
Tiya     NaN   NaN   NaN   NaN  71.0  69.0  71.0  66.0   NaN   NaN   NaN   NaN
Astha    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  66.0  56.0  77.0  34.0
Rohit    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  50.0  87.0  88.0  56.0
Rahul    NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  87.0  89.0  70.0  56.0
Shital   NaN   NaN   NaN   NaN   NaN   NaN   NaN   NaN  56.0  71.0  52.0  87.0

In [129]:
concat_2.fillna(value= "_")

         Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem   Mat   Eng   Sci  Chem
Ravi    45.0  54.0  66.0  54.0     _     _     _     _     _     _     _     _
Shyam   68.0  87.0  77.0  79.0     _     _     _     _     _     _     _     _
Saurav  35.0  36.0  88.0  58.0     _     _     _     _     _     _     _     _
Abhi    65.0  52.0  70.0  76.0     _     _     _     _     _     _     _     _
Siya       _     _     _     _  50.0  66.0  34.0  54.0     _     _     _     _
Riya       _     _     _     _  87.0  50.0  66.0  87.0     _     _     _     _
Piya       _     _     _     _  69.0  87.0  69.0  34.0     _     _     _     _
Tiya       _     _     _     _  71.0  69.0  71.0  66.0     _     _     _     _
Astha      _     _     _     _     _     _     _     _  66.0  56.0  77.0  34.0
Rohit      _     _     _     _     _     _     _     _  50.0  87.0  88.0  56.0
Rahul      _     _     _     _     _     _     _     _  87.0  89.0  70.0  56.0
Shital     _     _     _     _     _     _     _     _  56.0  71.0  52.0  87.0

In [130]:
#Lets Understand merge function

player_id_name=pd.DataFrame({'ID':[25,30,35,40,45,50,55],
                            'Name':['Ronaldo','Messi','Pele','Maradona','Harry','Pogba','Chhetri']})

In [131]:
player_id_name

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [132]:
player_detail=pd.DataFrame({'ID':[25,30,45,50,55],
                            'Age':[36,34,20,28,37],
                            'Country':['Porugal','Argentina','England','France','India']})

In [137]:
pd.merge(player_id_name,player_detail)

   ID     Name  Age    Country
0  25  Ronaldo   36    Porugal
1  30    Messi   34  Argentina
2  45    Harry   20    England
3  50    Pogba   28     France
4  55  Chhetri   37      India

In [138]:
player_detail

   ID  Age    Country
0  25   36    Porugal
1  30   34  Argentina
2  45   20    England
3  50   28     France
4  55   37      India

In [139]:
player_id_name

   ID      Name
0  25   Ronaldo
1  30     Messi
2  35      Pele
3  40  Maradona
4  45     Harry
5  50     Pogba
6  55   Chhetri

In [140]:
#lets understand join Operator

left=pd.DataFrame({'A':['A0','A1','A2'],
                  'B':['B0','B1','B2']},
                 index=['K0','K1','K2'])

right=pd.DataFrame({'C':['C0','C2','C3'],
                   'D':['D0','D2','D3']},
                  index=['K0','K2','K3'])

In [141]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [142]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [150]:
left.join(right, how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# Data Time Manipulation

In [152]:
date_range = pd.date_range('4/12/2021',periods =12)

In [153]:
date_range

DatetimeIndex(['2021-04-12', '2021-04-13', '2021-04-14', '2021-04-15',
               '2021-04-16', '2021-04-17', '2021-04-18', '2021-04-19',
               '2021-04-20', '2021-04-21', '2021-04-22', '2021-04-23'],
              dtype='datetime64[ns]', freq='D')

In [158]:
dates= pd.DataFrame(date_range, columns =['Date'], index = range(1,13))
dates

         Date
1  2021-04-12
2  2021-04-13
3  2021-04-14
4  2021-04-15
5  2021-04-16
6  2021-04-17
7  2021-04-18
8  2021-04-19
9  2021-04-20
10 2021-04-21
11 2021-04-22
12 2021-04-23

In [161]:
dates['Day']  = dates["Date"].dt.day
dates["Month"]=dates["Date"].dt.month
dates['Year'] = dates["Date"].dt.year

In [167]:
dates

         Date  Day  Month  Year
1  2021-04-12   12      4  2021
2  2021-04-13   13      4  2021
3  2021-04-14   14      4  2021
4  2021-04-15   15      4  2021
5  2021-04-16   16      4  2021
6  2021-04-17   17      4  2021
7  2021-04-18   18      4  2021
8  2021-04-19   19      4  2021
9  2021-04-20   20      4  2021
10 2021-04-21   21      4  2021
11 2021-04-22   22      4  2021
12 2021-04-23   23      4  2021

In [169]:
dates = dates.drop(columns = 'Date', axis = 0)

In [170]:
dates

    Day  Month  Year
1    12      4  2021
2    13      4  2021
3    14      4  2021
4    15      4  2021
5    16      4  2021
6    17      4  2021
7    18      4  2021
8    19      4  2021
9    20      4  2021
10   21      4  2021
11   22      4  2021
12   23      4  2021

In [171]:
{'Date_Time':['Jan 1 12:00 AM','Jan 2 12:00 AM']}

{'Date_Time': ['Jan 1 12:00 AM', 'Jan 2 12:00 AM']}

In [172]:
df = pd.DataFrame({'Date_Time':['Jan 1 12:00 AM','Jan 2 12:00 AM']})

In [173]:
df

        Date_Time
0  Jan 1 12:00 AM
1  Jan 2 12:00 AM

In [175]:
type(df)

pandas.core.frame.DataFrame

In [185]:
#df['Date'] = pd.to_datetime(df["Date_Time"], format = "%b")
df['Date']=pd.to_datetime(df['Date_Time'],format='%b %d %I:%M %p')

Given a DataFrame with a column of date strings, convert this column to datetime format.

In [244]:
data = {'date_str': ['2024-01-01', '2024-02-01', '2024-03-01']}
df = pd.DataFrame(data)

In [245]:
df

     date_str
0  2024-01-01
1  2024-02-01
2  2024-03-01

In [246]:
df["date_str"]= pd.to_datetime(df["date_str"], format = '%y ')
df

ValueError: time data "2024-01-01" doesn't match format "%y ", at position 0. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [225]:
data['Year'] = df["date_str"].dt.year
data["Month"] = df["date_str"].dt.month
data['Day'] = df["date_str"].dt.day

In [226]:
DF = pd.DataFrame(data)

From a datetime column, extract the year, month, and day into separate columns.

In [224]:
DF

     date_str  Year  Day  Month
0  2024-01-01  2024    1      1
1  2024-02-01  2024    1      2
2  2024-03-01  2024    1      3

Given two columns of dates, calculate the difference in days between them.

In [228]:
data = {'start_date': ['2024-01-01', '2024-02-01'], 'end_date': ['2024-01-10', '2024-02-10']}
df = pd.DataFrame(data)
df

   start_date    end_date
0  2024-01-01  2024-01-10
1  2024-02-01  2024-02-10

In [236]:
df['start_date'] = pd.to_datetime(df['start_date'])
df['end_date'] = pd.to_datetime(df['end_date'])

In [239]:
difference= df['end_date'] -df['start_date']

In [240]:
difference

0   9 days
1   9 days
dtype: timedelta64[ns]

Filter the DataFrame to include only rows where the date is within a specified range.

In [261]:
data = {'date_str': ['2024-01-01', '2024-02-01', '2024-03-01']}
df = pd.DataFrame(data)

df['date'] = pd.to_datetime(df['date_str'])
start_date = '2024-01-15'
end_date = '2024-02-15'

In [262]:
df

     date_str       date
0  2024-01-01 2024-01-01
1  2024-02-01 2024-02-01
2  2024-03-01 2024-03-01

In [267]:
start_date  = pd.to_datetime(start_date)
end_date = pd.to_datetime(end_date)

mast = (df['date']>= start_date) & (df['date'] <= end_date)
#mask = (df['date'] >= start_date) & (df['date'] <= end_date)

In [268]:
mast

0    False
1     True
2    False
Name: date, dtype: bool

In [271]:
df.loc[mask]

     date_str       date
1  2024-02-01 2024-02-01

Given a time series DataFrame, resample it to a different frequency (e.g., monthly, weekly).

In [324]:
date_rng = pd.date_range(start='2024-01-01', end='2024-01-31', freq='D')
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = range(1, len(df)+1)
df.set_index('date', inplace=True)

In [325]:
df

            data
date
2024-01-01     1
2024-01-02     2
2024-01-03     3
2024-01-04     4
2024-01-05     5
2024-01-06     6
2024-01-07     7
2024-01-08     8
2024-01-09     9
2024-01-10    10
2024-01-11    11
2024-01-12    12
2024-01-13    13
2024-01-14    14
2024-01-15    15
2024-01-16    16
2024-01-17    17
2024-01-18    18
2024-01-19    19
2024-01-20    20
2024-01-21    21
2024-01-22    22
2024-01-23    23
2024-01-24    24
2024-01-25    25
2024-01-26    26
2024-01-27    27
2024-01-28    28
2024-01-29    29
2024-01-30    30
2024-01-31    31

In [293]:
month_df = df.resample('M').sum()
month_df

            data
date
2024-01-31   496

Calculate a rolling mean on a time series DataFrame with a specified window size.

In [337]:
date_rng = pd.date_range(start='2024-01-01', end='2024-01-10', freq='D')

In [338]:
print(date_rng)
df = pd.DataFrame(date_rng, columns=['Date'])
df

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

        Date
0 2024-01-01
1 2024-01-02
2 2024-01-03
3 2024-01-04
4 2024-01-05
5 2024-01-06
6 2024-01-07
7 2024-01-08
8 2024-01-09
9 2024-01-10

In [341]:
df['Data'] = range(1,len(df)+1)

In [342]:
df

df.set_index('Date', inplace = True)

In [343]:
df

            data  Data
Date
2024-01-01     1     1
2024-01-02     2     2
2024-01-03     3     3
2024-01-04     4     4
2024-01-05     5     5
2024-01-06     6     6
2024-01-07     7     7
2024-01-08     8     8
2024-01-09     9     9
2024-01-10    10    10

In [347]:
df['rolling_mean'] = df['Data'].rolling(window=3).mean()

In [348]:
df['rolling_mean']

Date
2024-01-01    NaN
2024-01-02    NaN
2024-01-03    2.0
2024-01-04    3.0
2024-01-05    4.0
2024-01-06    5.0
2024-01-07    6.0
2024-01-08    7.0
2024-01-09    8.0
2024-01-10    9.0
Name: rolling_mean, dtype: float64

In [358]:
date_rng = pd.date_range(start='2024-01-01', end='2024-01-10', freq='D')
df = pd.DataFrame(date_rng, columns=['date'])
df['data'] = range(1, len(df) + 1)
df.set_index('date', inplace=True)

In [359]:
df

            data
date
2024-01-01     1
2024-01-02     2
2024-01-03     3
2024-01-04     4
2024-01-05     5
2024-01-06     6
2024-01-07     7
2024-01-08     8
2024-01-09     9
2024-01-10    10

In [360]:
df['shifted_data'] = df['data'].shift(1)

In [361]:
df['shifted_data']

date
2024-01-01    NaN
2024-01-02    1.0
2024-01-03    2.0
2024-01-04    3.0
2024-01-05    4.0
2024-01-06    5.0
2024-01-07    6.0
2024-01-08    7.0
2024-01-09    8.0
2024-01-10    9.0
Name: shifted_data, dtype: float64

In [362]:
df['cumulative_sum'] = df['data'].cumsum()

In [363]:
df['cumulative_sum']

date
2024-01-01     1
2024-01-02     3
2024-01-03     6
2024-01-04    10
2024-01-05    15
2024-01-06    21
2024-01-07    28
2024-01-08    36
2024-01-09    45
2024-01-10    55
Name: cumulative_sum, dtype: int64